Revit 2027 API
BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatError Property
 The resulting angle between the segments is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SegmentsAngleTooGreatError { get; }
Public Shared ReadOnly Property SegmentsAngleTooGreatError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SegmentsAngleTooGreatError {
	FailureDefinitionId^ get ();
}
static member SegmentsAngleTooGreatError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace